CopyOfRolecall_To_Fusion/Files/RoleCall_FU/Fusion/Contact/Request/contact_request.xml

<?xml version="1.0" encoding="ISO-8859-1" standalone="no"?>
<mstns:Envelope xmlns:mstns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:app4="http://xmlns.oracle.com/apps/cdm/foundation/parties/contactPointService/" xmlns:ns2="http://xmlns.oracle.com/apps/cdm/foundation/parties/contactPointService/" xmlns:app1="http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/" xmlns:ns4="http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/" xmlns:app2="http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/applicationModule/types/" xmlns:ns3="http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/applicationModule/types/" xmlns:ns1="http://xmlns.oracle.com/apps/cdm/foundation/parties/relationshipService/" xmlns:app3="http://xmlns.oracle.com/apps/cdm/foundation/parties/relationshipService/" xmlns:msdata="urn:schemas-microsoft-com:xml-msdata" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<mstns:Body>
		<app2:updatePerson>
			<app2:personParty>
				<app1:ObjectId>300000033216682</app1:ObjectId>
				<app1:PartyId>300000033216682</app1:PartyId>
				<app1:PersonProfile>
					<app1:PersonProfileId>300000033182668</app1:PersonProfileId>
					<app1:PersonFirstName>TestingFirstName</app1:PersonFirstName>
					<app1:PersonLastName>TestingLastName</app1:PersonLastName>
				</app1:PersonProfile>
				<app1:Relationship>
					<ns1:RelationshipRecId>300000033182669</ns1:RelationshipRecId>
					<ns1:RelationshipId>300000033182670</ns1:RelationshipId>
					<ns1:SubjectId>300000033182668</ns1:SubjectId>
					<ns1:Email>
						<app4:ContactPointId>300000033182674</app4:ContactPointId>
						<app4:ContactPointType>EMAIL</app4:ContactPointType>
						<app4:EmailAddress>test00212@test.com</app4:EmailAddress>
					</ns1:Email>
					<ns1:Phone>
						<app4:ContactPointId>300000033182668</app4:ContactPointId>
						<app4:ContactPointType>PHONE</app4:ContactPointType>
						<app4:PhoneCountryCode>91</app4:PhoneCountryCode>
						<app4:PhoneNumber>080-26673483</app4:PhoneNumber>
						<app4:PhoneLineType>GEN</app4:PhoneLineType>
					</ns1:Phone>
					<ns1:Phone>
						<app4:ContactPointId>300000033182668</app4:ContactPointId>
						<app4:ContactPointType>MOBILE</app4:ContactPointType>
						<app4:PhoneCountryCode>91</app4:PhoneCountryCode>
						<app4:PhoneNumber>9876654890</app4:PhoneNumber>
						<app4:PhoneLineType>GEN</app4:PhoneLineType>
					</ns1:Phone>
				</app1:Relationship>
			</app2:personParty>
		</app2:updatePerson>
	</mstns:Body>
</mstns:Envelope>